
&НаСервере
Процедура КодПриИзмененииНаСервере(ТекстГода)
	ПравильныйТекстГода = "";
	МодульПериодов.ФорматТекстаГода(ТекстГода, ПравильныйТекстГода);
	Объект.Код = Число(ПравильныйТекстГода);
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	КодПриИзмененииНаСервере(Элемент.ВыделенныйТекст);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	К.Код КАК Год
	|	ИЗ
	|   	Справочник.ПКалендарь КАК К
	|	УПОРЯДОЧИТЬ ПО
	|		Год ВОЗР";
	ТаблицаЗначенийГодов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ЗначениеВРеквизитФормы(ТаблицаЗначенийГодов, "реквТЗГодов");
	Объект.Код = Год(ТекущаяДата());
КонецПроцедуры

